examples/old_examples/naca0012_optimization/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

// Simple background mesh for snappyHexMesh
vertices
(
    (-4.0 -4.0 -0.1)    // 0
    (8.0 -4.0 -0.1)    // 1
    (8.0 4.0 -0.1)    // 2
    (-4.0 4.0 -0.1)    // 3
    (-4.0 -4.0 0.1)    // 4
    (8.0 -4.0 0.1)    // 5
    (8.0 4.0 0.1)    // 6
    (-4.0 4.0 0.1)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    
    topWall
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    
    bottomWall
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
