examples/old_examples/naca0012_optimization/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       32736;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       32766;
    }
    topWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          40;
        startFace       32796;
    }
    bottomWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          40;
        startFace       32836;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4144;
        startFace       32876;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1328;
        startFace       37020;
    }
)

// ************************************************************************* //
